; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v7 - type_2 ?v5 - type_1)
 	      (pred_3 ?v3 - object ?v5 - type_1)
	      (pred_1 ?v7 - type_2 ?v6 - type_3)
	      (pred_2 ?v7 - type_2 ?v3 - object ?v6 - type_3))

   (:action op_2
       :parameters  (?v7 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_4 ?v7 ?v1))
       :effect (and  (pred_4 ?v7 ?v8)
		     (not (pred_4 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v4 - object ?v2 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v2) (pred_4 ?v7 ?v2) (pred_1 ?v7 ?v6))
       :effect (and (pred_2 ?v7 ?v4 ?v6)
		    (not (pred_3 ?v4 ?v2)) 
		    (not (pred_1 ?v7 ?v6))))

   (:action op_1
       :parameters (?v7 - type_2 ?v4 - object ?v2 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v4 ?v6) (pred_4 ?v7 ?v2))
       :effect (and (pred_3 ?v4 ?v2)
		    (pred_1 ?v7 ?v6)
		    (not (pred_2 ?v7 ?v4 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_07 - type_2
obj_06 obj_12 obj_08 obj_03 - type_3
obj_01 obj_13 obj_14 obj_11 - type_1
obj_05 obj_04 obj_02 obj_10 - object)
(:init
(pred_4 obj_09 obj_11)
(pred_1 obj_09 obj_06)
(pred_1 obj_09 obj_12)
(pred_4 obj_07 obj_14)
(pred_1 obj_07 obj_08)
(pred_1 obj_07 obj_03)
(pred_3 obj_05 obj_01)
(pred_3 obj_04 obj_13)
(pred_3 obj_02 obj_01)
(pred_3 obj_10 obj_01)
)
(:goal
(and
(pred_3 obj_05 obj_14)
(pred_3 obj_04 obj_11)
(pred_3 obj_02 obj_11)
(pred_3 obj_10 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_09 obj_14) (pred_4 obj_07 obj_14))))
    (always (not (and (pred_4 obj_09 obj_11) (pred_4 obj_07 obj_11))))
  )
)
)

; plan
1. (op_2 obj_09 obj_11 obj_13)
   deleted: (pred_4 obj_09 obj_11)
   added: (pred_4 obj_09 obj_13)
   goals met: 1 of 4
2. (op_2 obj_07 obj_14 obj_13)
   deleted: (pred_4 obj_07 obj_14)
   added: (pred_4 obj_07 obj_13)
   goals met: 1 of 4
3. (op_3 obj_09 obj_04 obj_13 obj_12)
   deleted: (pred_3 obj_04 obj_13) (pred_1 obj_09 obj_12)
   added: (pred_2 obj_09 obj_04 obj_12)
   goals met: 1 of 4
4. (op_2 obj_07 obj_13 obj_11)
   deleted: (pred_4 obj_07 obj_13)
   added: (pred_4 obj_07 obj_11)
   goals met: 1 of 4
5. (op_2 obj_09 obj_13 obj_01)
   deleted: (pred_4 obj_09 obj_13)
   added: (pred_4 obj_09 obj_01)
   goals met: 1 of 4
6. (op_2 obj_07 obj_11 obj_01)
   deleted: (pred_4 obj_07 obj_11)
   added: (pred_4 obj_07 obj_01)
   goals met: 1 of 4
7. (op_3 obj_09 obj_02 obj_01 obj_06)
   deleted: (pred_3 obj_02 obj_01) (pred_1 obj_09 obj_06)
   added: (pred_2 obj_09 obj_02 obj_06)
   goals met: 1 of 4
8. (op_3 obj_07 obj_05 obj_01 obj_03)
   deleted: (pred_3 obj_05 obj_01) (pred_1 obj_07 obj_03)
   added: (pred_2 obj_07 obj_05 obj_03)
   goals met: 1 of 4
9. (op_2 obj_07 obj_01 obj_14)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_14)
   goals met: 1 of 4
10. (op_2 obj_09 obj_01 obj_11)
   deleted: (pred_4 obj_09 obj_01)
   added: (pred_4 obj_09 obj_11)
   goals met: 1 of 4
11. (op_1 obj_09 obj_02 obj_11 obj_06)
   deleted: (pred_2 obj_09 obj_02 obj_06)
   added: (pred_3 obj_02 obj_11) (pred_1 obj_09 obj_06)
   goals met: 2 of 4
12. (op_1 obj_09 obj_04 obj_11 obj_12)
   deleted: (pred_2 obj_09 obj_04 obj_12)
   added: (pred_3 obj_04 obj_11) (pred_1 obj_09 obj_12)
   goals met: 3 of 4
13. (op_1 obj_07 obj_05 obj_14 obj_03)
   deleted: (pred_2 obj_07 obj_05 obj_03)
   added: (pred_3 obj_05 obj_14) (pred_1 obj_07 obj_03)
   goals met: 4 of 4
